SpenceKonde/DxCore/megaavr/variants/48pin-standard/pins_arduino.h
// USART 0
#define HWSERIAL0_MUX_COUNT             2
#define HWSERIAL0_MUX                   PORTMUX_USART0_DEFAULT_gc
#define HWSERIAL0_MUX_PINSWAP_1         PORTMUX_USART0_ALT1_gc
#define HWSERIAL0_MUX_PINSWAP_NONE      PORTMUX_USART0_NONE_gc
#define PIN_HWSERIAL0_TX                PIN_PA0
#define PIN_HWSERIAL0_RX                PIN_PA1
#define PIN_HWSERIAL0_XCK               PIN_PA2
#define PIN_HWSERIAL0_XDIR              PIN_PA3
#define PIN_HWSERIAL0_TX_PINSWAP_1      PIN_PA4
#define PIN_HWSERIAL0_RX_PINSWAP_1      PIN_PA5
#define PIN_HWSERIAL0_XCK_PINSWAP_1     PIN_PA6
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    PIN_PA7

// USART1
#define HWSERIAL1_MUX_COUNT             2
#define HWSERIAL1_MUX                   PORTMUX_USART1_DEFAULT_gc
#define HWSERIAL1_MUX_PINSWAP_1         PORTMUX_USART1_ALT1_gc
#define HWSERIAL1_MUX_PINSWAP_NONE      PORTMUX_USART1_NONE_gc
#define PIN_HWSERIAL1_TX                PIN_PC0
#define PIN_HWSERIAL1_RX                PIN_PC1
#define PIN_HWSERIAL1_XCK               PIN_PC2
#define PIN_HWSERIAL1_XDIR              PIN_PC3
#define PIN_HWSERIAL1_TX_PINSWAP_1      PIN_PC4
#define PIN_HWSERIAL1_RX_PINSWAP_1      PIN_PC5
#define PIN_HWSERIAL1_XCK_PINSWAP_1     PIN_PC6
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    PIN_PC7

// USART 2
#define HWSERIAL2_MUX_COUNT             2
#define HWSERIAL2_MUX                   PORTMUX_USART2_DEFAULT_gc
#define HWSERIAL2_MUX_PINSWAP_1         PORTMUX_USART2_ALT1_gc
#define HWSERIAL2_MUX_PINSWAP_NONE      PORTMUX_USART2_NONE_gc
#define PIN_HWSERIAL2_TX                PIN_PF0
#define PIN_HWSERIAL2_RX                PIN_PF1
#define PIN_HWSERIAL2_XCK               PIN_PF2
#define PIN_HWSERIAL2_XDIR              PIN_PF3
#define PIN_HWSERIAL2_TX_PINSWAP_1      PIN_PF4
#define PIN_HWSERIAL2_RX_PINSWAP_1      PIN_PF5
#define PIN_HWSERIAL2_XCK_PINSWAP_1     NOT_A_PIN
#define PIN_HWSERIAL2_XDIR_PINSWAP_1    NOT_A_PIN

// USART 3
#define HWSERIAL3_MUX_COUNT             2
#define HWSERIAL3_MUX                   PORTMUX_USART3_DEFAULT_gc
#define HWSERIAL3_MUX_PINSWAP_1         PORTMUX_USART3_ALT1_gc
#define HWSERIAL3_MUX_PINSWAP_NONE      PORTMUX_USART3_NONE_gc
#define PIN_HWSERIAL3_TX                PIN_PB0
#define PIN_HWSERIAL3_RX                PIN_PB1
#define PIN_HWSERIAL3_XCK               PIN_PB2
#define PIN_HWSERIAL3_XDIR              PIN_PB3
#define PIN_HWSERIAL3_TX_PINSWAP_1      PIN_PB4
#define PIN_HWSERIAL3_RX_PINSWAP_1      PIN_PB5
#define PIN_HWSERIAL3_XCK_PINSWAP_1     NOT_A_PIN
#define PIN_HWSERIAL3_XDIR_PINSWAP_1    NOT_A_PIN

// USART 4
#define HWSERIAL4_MUX_COUNT             2
#define HWSERIAL4_MUX                   PORTMUX_USART4_DEFAULT_gc
#define HWSERIAL4_MUX_PINSWAP_1         NOT_A_MUX  /* destined for removal */
#define HWSERIAL4_MUX_PINSWAP_NONE      PORTMUX_USART4_NONE_gc
#define PIN_HWSERIAL4_TX                PIN_PE0
#define PIN_HWSERIAL4_RX                PIN_PE1
#define PIN_HWSERIAL4_XCK               PIN_PE2
#define PIN_HWSERIAL4_XDIR              PIN_PE3
#define PIN_HWSERIAL4_TX_PINSWAP_1      NOT_A_PIN  /* destined for removal */
#define PIN_HWSERIAL4_RX_PINSWAP_1      NOT_A_PIN  /* destined for removal */
#define PIN_HWSERIAL4_XCK_PINSWAP_1     NOT_A_PIN  /* destined for removal */
#define PIN_HWSERIAL4_XDIR_PINSWAP_1    NOT_A_PIN  /* destined for removal */

/*     ###  #   #  ###  #     ###   ###      ####  ### #   #  ###
      #   # ##  # #   # #    #   # #         #   #  #  ##  # #
      ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
      #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
      #   # #   # #   # ####  ###   ###      #     ### #   #  #*/
/* See 64-pin pins_arduino for more info */
#define PIN_A0   PIN_PD0
#define PIN_A1   PIN_PD1
#define PIN_A2   PIN_PD2
#define PIN_A3   PIN_PD3
#define PIN_A4   PIN_PD4
#define PIN_A5   PIN_PD5
#define PIN_A6   PIN_PD6
#define PIN_A7   PIN_PD7
#define PIN_A8   PIN_PE0
#define PIN_A9   PIN_PE1
#define PIN_A10  PIN_PE2
#define PIN_A11  PIN_PE3
#define PIN_A16  PIN_PF0
#define PIN_A17  PIN_PF1
#define PIN_A18  PIN_PF2
#define PIN_A19  PIN_PF3
#define PIN_A20  PIN_PF4
#define PIN_A21  PIN_PF5
static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6;
static const uint8_t A7  = PIN_A7;
static const uint8_t A8  = PIN_A8;
static const uint8_t A9  = PIN_A9;
static const uint8_t A10 = PIN_A10;
static const uint8_t A11 = PIN_A11;
static const uint8_t A16 = PIN_A16;
static const uint8_t A17 = PIN_A17;
static const uint8_t A18 = PIN_A18;
static const uint8_t A19 = PIN_A19;
static const uint8_t A20 = PIN_A20;
static const uint8_t A21 = PIN_A21;
/* Internal and library use only - see 64-pin standard version for details.*/
#define  AIN0  ADC_CH(0)
#define  AIN1  ADC_CH(1)
#define  AIN2  ADC_CH(2)
#define  AIN3  ADC_CH(3)
#define  AIN4  ADC_CH(4)
#define  AIN5  ADC_CH(5)
#define  AIN6  ADC_CH(6)
#define  AIN7  ADC_CH(7)
#define  AIN8  ADC_CH(8)
#define  AIN9  ADC_CH(9)
#define AIN10 ADC_CH(10)
#define AIN11 ADC_CH(11)
#define AIN16 ADC_CH(16)
#define AIN17 ADC_CH(17)
#define AIN18 ADC_CH(18)
#define AIN19 ADC_CH(19)
#define AIN20 ADC_CH(20)
#define AIN21 ADC_CH(21)

// *INDENT-OFF*
/*    ####  ### #   #      ###  ####  ####   ###  #   #  ###
      #   #  #  ##  #     #   # #   # #   # #   #  # #  #
      ####   #  # # #     ##### ####  ####  #####   #    ###
      #      #  #  ##     #   # #  #  #  #  #   #   #       #
      #     ### #   #     #   # #   # #   # #   #   #    #*/

#ifdef ARDUINO_MAIN
  /* this guards against multiple definition errors, since this file gets included by everything,
     but only in one case should these tables be generated */
  const uint8_t digital_pin_to_port[] = {
    PA, //  0 PA0/XTAL0/CLKIN
    PA, //  1 PA1/XTAL1
    PA, //  2 PA2/SDA
    PA, //  3 PA3/SCL
    PA, //  4 PA4/MOSI
    PA, //  5 PA5/MISO
    PA, //  6 PA6/SCK
    PA, //  7 PA7/SS/CLKOUT/LED_BUILTIN
    PB, //  8 PB0/USART3_Tx
    PB, //  9 PB1/USART3_Rx
    PB, // 10 PB2
    PB, // 11 PB3
    PB, // 12 PB4/(TCB2 PWM)
    PB, // 13 PB5
    PC, // 14 PC0/USART1_Tx
    PC, // 15 PC1/USART1_Rx
    PC, // 16 PC2
    PC, // 17 PC3
    PC, // 18 PC4
    PC, // 19 PC5
    PC, // 20 PC6
    PC, // 21 PC7
    PD, // 22 PD0/AIN0
    PD, // 23 PD1/AIN1
    PD, // 24 PD2/AIN2
    PD, // 25 PD3/AIN3
    PD, // 26 PD4/AIN4
    PD, // 27 PD5/AIN5
    PD, // 28 PD6/AIN6
    PD, // 29 PD7/AIN7/AREF
    PE, // 30 PE0/AIN8
    PE, // 31 PE1/AIN9
    PE, // 32 PE2/AIN10
    PE, // 33 PE3/AIN11
    PF, // 34 PF0/AIN16/USART2_Tx/TOSC1
    PF, // 35 PF1/AIN17/USART2_Rx/TOSC2
    PF, // 36 PF2/AIN18
    PF, // 37 PF3/AIN19
    PF, // 38 PF4/AIN20
    PF, // 39 PF5/AIN21
    PF, // 40 PF6 RESET
  //PF, // 55 PF7 (UPDI)
  };
  const uint8_t digital_pin_to_bit_position[] = {
    #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
      PIN0_bp,            // PA0
    #else
      NOT_A_PIN,
    #endif
    #if CLOCK_SOURCE == 1 // PA1 also used for crystal
      NOT_A_PIN,  //   1 PA1
    #else
      // PA1 used for external crystal.
      PIN1_bp,
    #endif
    PIN2_bp, //  2 PA2/SDA
    PIN3_bp, //  3 PA3/SCL
    PIN4_bp, //  4 PA4/MOSI
    PIN5_bp, //  5 PA5/MISO
    PIN6_bp, //  6 PA6/SCK
    PIN7_bp, //  7 PA7/SS/CLKOUT
    PIN0_bp, //  8 PB0/USART3_Tx
    PIN1_bp, //  9 PB1/USART3_Rx
    PIN2_bp, // 10 PB2
    PIN3_bp, // 11 PB3
    PIN4_bp, // 12 PB4/(TCB2 PWM)
    PIN5_bp, // 13 PB5
    PIN0_bp, // 14 PC0/USART1_Tx
    PIN1_bp, // 15 PC1/USART1_Rx
    PIN2_bp, // 16 PC2
    PIN3_bp, // 17 PC3
    PIN4_bp, // 18 PC4
    PIN5_bp, // 19 PC5
    PIN6_bp, // 20 PC6
    PIN7_bp, // 21 PC7
    PIN0_bp, // 22 PD0/AIN0
    PIN1_bp, // 23 PD1/AIN1
    PIN2_bp, // 24 PD2/AIN2
    PIN3_bp, // 25 PD3/AIN3
    PIN4_bp, // 26 PD4/AIN4
    PIN5_bp, // 27 PD5/AIN5
    PIN6_bp, // 28 PD6/AIN6
    PIN7_bp, // 29 PD7/AIN7/AREF
    PIN0_bp, // 30 PE0/AIN8
    PIN1_bp, // 31 PE1/AIN9
    PIN2_bp, // 32 PE2/AIN10
    PIN3_bp, // 33 PE3/AIN11
    PIN0_bp, // 34 PF0/USART2_Tx/TOSC1
    PIN1_bp, // 35 PF1/USART2_Rx/TOSC2
    PIN2_bp, // 36 PF2/AIN12
    PIN3_bp, // 37 PF3/AIN13
    PIN4_bp, // 38 PF4/AIN14
    PIN5_bp, // 39 PF5/AIN15/LED_BUILTIN
    PIN6_bp, // 40 PF6 RESET
  //PIN7_bm, // 55 PF7 (UPDI)
  };
  const uint8_t digital_pin_to_bit_mask[] = {
    #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
      PIN0_bm,            // PA0
    #else
      NOT_A_PIN,
    #endif
    #if CLOCK_SOURCE == 1 // PA1 also used for crystal
      NOT_A_PIN,  //   1 PA1
    #else
      // PA1 used for external crystal.
      PIN1_bm,
    #endif
    PIN2_bm, //  2 PA2/SDA
    PIN3_bm, //  3 PA3/SCL
    PIN4_bm, //  4 PA4/MOSI
    PIN5_bm, //  5 PA5/MISO
    PIN6_bm, //  6 PA6/SCK
    PIN7_bm, //  7 PA7/SS/CLKOUT
    PIN0_bm, //  8 PB0/USART3_Tx
    PIN1_bm, //  9 PB1/USART3_Rx
    PIN2_bm, // 10 PB2
    PIN3_bm, // 11 PB3
    PIN4_bm, // 12 PB4/(TCB2 PWM)
    PIN5_bm, // 13 PB5
    PIN0_bm, // 14 PC0/USART1_Tx
    PIN1_bm, // 15 PC1/USART1_Rx
    PIN2_bm, // 16 PC2
    PIN3_bm, // 17 PC3
    PIN4_bm, // 18 PC4
    PIN5_bm, // 19 PC5
    PIN6_bm, // 20 PC6
    PIN7_bm, // 21 PC7
    PIN0_bm, // 22 PD0/AIN0
    PIN1_bm, // 23 PD1/AIN1
    PIN2_bm, // 24 PD2/AIN2
    PIN3_bm, // 25 PD3/AIN3
    PIN4_bm, // 26 PD4/AIN4
    PIN5_bm, // 27 PD5/AIN5
    PIN6_bm, // 28 PD6/AIN6
    PIN7_bm, // 29 PD7/AIN7/AREF
    PIN0_bm, // 30 PE0/AIN8
    PIN1_bm, // 31 PE1/AIN9
    PIN2_bm, // 32 PE2/AIN10
    PIN3_bm, // 33 PE3/AIN11
    PIN0_bm, // 34 PF0/USART2_Tx/TOSC1
    PIN1_bm, // 35 PF1/USART2_Rx/TOSC2
    PIN2_bm, // 36 PF2/AIN12
    PIN3_bm, // 37 PF3/AIN13
    PIN4_bm, // 38 PF4/AIN14
    PIN5_bm, // 39 PF5/AIN15/LED_BUILTIN
    PIN6_bm, // 40 PF6 RESET
  //PIN7_bm, // 55 PF7 (UPDI)
  };
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA0/USART0_Tx/CLKIN
    NOT_ON_TIMER, //  1 PA1/USART0_Rx
    NOT_ON_TIMER, //  2 PA2/SDA
    NOT_ON_TIMER, //  3 PA3/SCL
    TIMERD0,      //  4 PA4/MOSI      WOA
    TIMERD0,      //  5 PA5/MISO      WOB
    TIMERD0,      //  6 PA6/SCK       WOC mirrors WOA
    TIMERD0,      //  7 PA7/SS/CLKOUT WOD mirrors WOB
    NOT_ON_TIMER, //  8 PB0
    NOT_ON_TIMER, //  9 PB1
    NOT_ON_TIMER, // 10 PB2
    NOT_ON_TIMER, // 11 PB3
    NOT_ON_TIMER, // 12 PB4
    NOT_ON_TIMER, // 13 PB5
    TIMERB2,      // 16 PC0
    TIMERB3,      // 17 PC1
    NOT_ON_TIMER, // 18 PC2
    NOT_ON_TIMER, // 19 PC3
    NOT_ON_TIMER, // 20 PC4
    NOT_ON_TIMER, // 21 PC5
    NOT_ON_TIMER, // 20 PC6
    NOT_ON_TIMER, // 21 PC7
    NOT_ON_TIMER, // 22 PD0/AIN0
    NOT_ON_TIMER, // 23 PD1/AIN1
    NOT_ON_TIMER, // 24 PD2/AIN2
    NOT_ON_TIMER, // 25 PD3/AIN3
    NOT_ON_TIMER, // 26 PD4/AIN4
    NOT_ON_TIMER, // 27 PD5/AIN5
    DACOUT,       // 28 PD6/AIN6
    NOT_ON_TIMER, // 29 PD7/AIN7/AREF
    NOT_ON_TIMER, // 30 PE0/AIN8
    NOT_ON_TIMER, // 31 PE1/AIN9
    NOT_ON_TIMER, // 32 PE2/AIN10
    NOT_ON_TIMER, // 33 PE3/AIN11
    NOT_ON_TIMER, // 34 PF0/USART2_Tx/TOSC1
    NOT_ON_TIMER, // 35 PF1/USART2_Rx/TOSC2
    NOT_ON_TIMER, // 36 PF2/AIN12
    NOT_ON_TIMER, // 37 PF3/AIN13
    TIMERB0,      // 38 PF4/AIN14
    TIMERB1,      // 39 PF5/AIN15
    NOT_ON_TIMER,  // 40 PF6 RESET
  //NOT_ON_TIMER, //  55 PF7 (UPDI)
  };

#endif

#endif
